SoumyaCode74/STM32_MCU_Peripherals/Peripherals/SPI_Test/SPI_Driver/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32f429xx.h"

int main(void)
{
    /**
     * @brief Set clock speed of AHBx, APBy. Target: PCLK = HSICLK/16 = 1 MHz
     */
	RCC->CFGR &= ~(0xF << 4);			///<- Reset bits of HPRE field
	RCC->CFGR |=  (0xA << 4);			///<- Set HPRE field for pre-scaling by 8
	RCC->CFGR &= ~(0x7 << 13);			///<- Reset bits of PPRE2 field for APB2
	RCC->CFGR |=  (0x4 << 13);			///<- Set PPRE2 field for pre-scaling by 2
	/**
	 * @brief Enable clock access to GPIOA, GPIOE, SPI1, and SPI4
	 */
	RCC->AHB1ENR |= (1 << 0) | (1 << 4);	///<- Enable clock access to GPIOA, GPIOE
	RCC->APB2ENR |= (1 << 12) | (1 << 13);	///<- Enable clock access to SPI1, SPI4
	/**
	 * @brief Configure GPIOA pins to Alternate function mode for SPI1
	 */
	GPIOA->MODER &= ~( (0x3 << 8) | (0x3 << 10) | (0x3 << 12) | (0x3 << 14) );
	GPIOA->MODER |=  ( (0x2 << 8) | (0x2 << 10) | (0x2 << 12) | (0x2 << 14));	///<- Set pins 4, 5, 6, 7 to AF mode
	GPIOA->AFR[0] &= ~( (0xF << 4*4) | (0xF << 5*4) | (0xF << 6*4) | (0xF << 7*4) );
	GPIOA->AFR[0] |= ( (0x5 << 4*4) | (0x5 << 5*4) | (0x5 << 6*4) | (0x5 << 7*4) ); ///<- Set pins 4, 5, 6, 7 to AFR5

	/**
	 * @brief Configure GPIOE pins to Alternate function mode for SPI4
	 */
	GPIOE->MODER &= ~( (0x3 << 4) | (0x3 << 8) | (0x3 << 10) | (0x3 << 12) );
	GPIOE->MODER |=  ( (0x2 << 4) | (0x2 << 8) | (0x2 << 10) | (0x2 << 12) );	///<- Set pins 4, 5, 6, 7 to AF mode
	GPIOE->AFR[0] &= ~( (0xF << 2*4) | (0xF << 4*4) | (0xF << 5*4) | (0xF << 6*4) );
	GPIOE->AFR[0] |= ( (0x5 << 2*4) | (0x5 << 4*4) | (0x5 << 5*4) | (0x5 << 6*4) ); ///<- Set pins 4, 5, 6, 7 to AFR5

	/*!********************END OF RCC AND GPIO SETTINGS*************/
	/*!********************BEGIN SPI SETTING************************/
	/**
	 * @brief Configure SPI1 as SPI Master
	 */
	SPI1->CR1 &= ~(0x1 << 6);	///<- Disable the SPI module for settings
	SPI1->CR1 &= ~(0x1 << 15);	///<- Set full-duplex by resetting the BIDIMODE field
	SPI1->CR1 &= ~(0x1 << 11);	///<- Set the Data frame format to 8-bit


	/* Loop forever */
	for(;;);
}
